Repository: pingfangx/TranslatorX-other
Catalog: AndroidDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: "Compositing Digital Images" was published in Computer Graphics Volume 18, Number 3 dated July 1984.
zh_cn: "合成数字图像" 发表于 1984 年 7 月的 Computer Graphics 第 18 卷第 3 期。

source: "Scrap" views are still attached to their parent RecyclerView but are eligible for rebinding and reuse.
zh_cn: “废弃” view 仍附加到其父 RecyclerView，但可以重新绑定和重用。

source: #Animation
zh_cn: #动画

source: (DrawerLayout implements this pattern.)
zh_cn: (DrawerLayout 实现了这种模式。)

source: (If you did not choose to view a preview, Android Studio skips this step, and converts your images immediately.) During the preview step, you can adjust the quality setting for each image individually, as described below.
zh_cn: (如果你未选择查看预览，Android Studio 会跳过此步骤，并立即转换图像。)在预览步骤中，你可以单独调整每个图像的质量设置，如下所述。

source: (Note that in LabelView, the real work is done by a private measureWidth() method.)
zh_cn: (注意在 LabelView 中，真正起作用的是私有的 measureWidth() 方法。)

source: (Note that the list of TV inputs available on the system can be obtained by calling TvInputManager#getTvInputList().)
zh_cn: (请注意，可以通过调用 TvInputManager#getTvInputList() 来获取系统上可用的电视输入列表。)

source: (Note that you should avoid using SYSTEM_UI_FLAG_LAYOUT_HIDE_NAVIGATION by itself.) If you have set the window flag FLAG_FULLSCREEN to hide the status bar (instead of using SYSTEM_UI_FLAG_FULLSCREEN), then a hidden status bar will be considered a "stable" state for purposes here.
zh_cn: (请注意，你应该避免单独使用 SYSTEM_UI_FLAG_LAYOUT_HIDE_NAVIGATION。)如果你已将窗口标志 FLAG_FULLSCREEN 设置为隐藏状态栏(而不是使用 SYSTEM_UI_FLAG_FULLSCREEN)，然后隐藏状态栏将被视为 "稳定" 状态。

source: (See MeasureSpec.makeMeasureSpec for more details.) This was triggered when a RelativeLayout container was placed in a scrolling container, such as a ScrollView or HorizontalScrollView.
zh_cn: （有关详细信息，请参阅 MeasureSpec.makeMeasureSpec。）当 RelativeLayout 容器放置在滚动容器（如 ScrollView 或 Horizo​​ntalScrollView）中时会触发此操作。

source: (The NinePatch image is saved as res/drawable/my_button_background.9.png
zh_cn: (该 NinePatch 图保存在 res/drawable/my_button_background.9.png

source: (When you specify an ID to an XML resource using the plus sign—in the format android:id="@+id/name"—it means that the "name" ID does not exist and should be created.)
zh_cn: (当你使用加号为 XML 资源指定 ID 时，格式为 android:id="@+id/name" - 这意味着 "name" ID 不存在且应该被创造。)

source: (e.g. RecyclerView.ViewHolder.getAdapterPosition(), findViewHolderForAdapterPosition(int)) You should use these methods when you need to work with up-to-date adapter positions even if they may not have been reflected to layout yet.
zh_cn: (例如 RecyclerView.ViewHolder.getAdapterPosition()，findViewHolderForAdapterPosition(int))当你使用这些方法时需要使用最新的适配器位置，即使它们可能尚未反映到布局中。

source: (e.g. getAdapterPosition(), findViewHolderForAdapterPosition(int)) You should use these methods when you need to work with up-to-date adapter positions even if they may not have been reflected to layout yet.
zh_cn: (比如 getAdapterPosition()，findViewHolderForAdapterPosition(int)) 当你需要去使用最新的适配器位置时，你应该使用这些方法，即使这些位置还没有针对布局进行更新。

source: -- similar, but the endpoints of the chain will not be spread out
zh_cn: -- 类似地，但链的端点将不会被展开

source: -- the default.
zh_cn: -- 默认的。

source: -- the elements of the chain will be packed together.
zh_cn: -- 链的元素将被打包到一起。

source: -- the elements will be spread out
zh_cn: -- 元素将被展开

source: /** If value is not a valid number, original port number is used.
zh_cn: /** 如果值不是有效的数字，将会使用原始端口。

source: /** Set port.
zh_cn: /** 设置端口。

source: // Method is documented to just ignore invalid user input.
zh_cn: // 方法文案表明会忽略无效的用户输入。

source: // phew, made it all the way } catch (Exception e) { // I'll just catch all exceptions
zh_cn: // 全部都这样做 } catch (Exception e) { // 捕获所有异常

source: // serverPort will just be unchanged.
zh_cn: // 服务端口将保持不变。

source: 0 is front and center.
zh_cn: 0 是前面及中心。

source: 0 meaning compress for small size, 100 meaning compress for max quality.
zh_cn: 0 表示小尺寸压缩，100 表示​​最大质量压缩。

source: 1 is one full page position to the right, and -1 is one page position to the left.
zh_cn: 1 是右侧的一个整页位置，-1 是左侧的一页位置。

source: 360) hsv[1] is Saturation [0...1] hsv[2] is Value [0...1]
zh_cn: 360) ，hsv[1] 是 Saturation（饱合度） [0...1] ，hsv[2] 是 Value（明度） [0...1] 。

source: 360) hsv[1] is Saturation [0...1] hsv[2] is Value [0...1] If hsv values are out of range, they are pinned.
zh_cn: 360) ，hsv[1] 是 Saturation（饱合度） [0...1] ，hsv[2] 是 Value（明度） [0...1] 。如果 hsv 值超出范围，则它们被固定。

source: A horizontal constraint to the parent
zh_cn: 相对于父布局的水平约束

source: The left side of a view is constrained to the left side of the parent
zh_cn: 一个 view 的左边限制为 parent 的左边。

source: ConstraintLayout allows you to create large and complex layouts with a flat view hierarchy (no nested view groups).
zh_cn: 翻译于：20170505 平方X 参考： [1]_SOLID.[译文]使用 ConstraintLayout 构建一个响应式的 UI.http://www.jianshu.com/p/f61227a2775f [2].weiyf.【双语】使用 ConstraintLayout 构建响应式 UI(Build a Responsive UI with ConstraintLayout).https://weiyf.cn/2017/03/10/Build%20a%20Responsive%20UI%20with%20ConstraintLayout/ ConstraintLayout 允许你使用平面 view 层次结构创建大而复杂的布局(没有嵌套 view groups)。

source: ConstraintLayout is available in an API library that's compatible with Android 2.3 (API level 9) and higher.
zh_cn: ConstraintLayout 在 API 库中是可用的，最低兼容至 Android2.3。

source: Capturing groups are indexed from left to right, starting at one.
zh_cn: Capturing groups 是从左到右的索引，从 1 开始。

source: Cold startup takes 5 seconds or longer.
zh_cn: Cold 启动需要 5 秒或更长时间。

source: Hot startup takes 1.5 seconds or longer.
zh_cn: Hot 启动需要 1.5 秒或更长时间。

source: Warm startup takes 2 seconds or longer.
zh_cn: Warm 启动需要 2 秒或更长时间。

source: WebP is an image file format from Google that provides lossy compression (like JPEG) as well as transparency (like PNG) but can provide better compression than either JPEG or PNG.
zh_cn: WebP 是来自 Google 的图像文件格式，提供有损压缩(如 JPEG)以及透明度(如 PNG)，但可提供比 JPEG 或 PNG 更好的压缩效果。

source: Figure 1. The Converting Images to WebP dialog
zh_cn: Figure 1. 将图像转换为 WebP 对话框

source: Figure 2. Converting a JPG to WebP format at 75% quality
zh_cn: Figure 2. 以 75%的质量将 JPG 转换为 WebP 格式

source: Figure 3. Converting a JPG to WebP format at 0% quality
zh_cn: Figure 3. 将 JPG 转换为 0％质量的 WebP 格式

source: Figure 3. The menu to convert a layout to ConstraintLayout
zh_cn: Figure 3. 将一个布局转换为 ConstraintLayout 的菜单

source: Note: 9-patch files cannot be converted to WebP images.
zh_cn: Note: 9-patch 文件无法转换为 WebP 图像。

source: Note: ConstraintLayout is available as a support library that you can use on Android systems starting with API level 9 (Gingerbread).
zh_cn: Note: ConstraintLayout 可用作支持库，你可以在从 API 级别 9(Gingerbread)开始的 Android 系统上使用。

source: Note: Because no markup is recognized within a CDATASection, character numeric references cannot be used as an escape mechanism when serializing.
zh_cn: Note: 由于 CDATASection 中未识别出标记，因此在序列化时，字符数字引用不能用作转义机制。

source: Note: Because support for lossless and transparent WebP images is only available in Android 4.3 and higher, your project must declare a minSdkVersion of 18 or higher to create lossless or transparent WebP images using Android Studio.
zh_cn: Note: 由于对无损和透明 WebP 图像的支持仅适用于 Android 4.3 及更高版本，因此你的项目必须声明 18 或更高的 minSdkVersion 才能创建无损或透明的 WebP 图像使用 Android Studio。

source: Note: If you set the quality to 100% and the minSdkVersion is set to 18 or higher, Android Studio automatically switches to lossless encoding instead.
zh_cn: Note: 如果将质量设置为 100％并且 minSdkVersion 设置为 18 或更高，则 Android Studio 会自动切换到无损编码。

source: Note: One potential solution in the serialization process is to end the CDATA section before the character, output the character using a character reference or entity reference, and open a new CDATA section for any further characters in the text node.
zh_cn: Note: 序列化过程中的一个可能的解决方案是在字符前结束 CDATA 部分，使用字符引用或实体引用输出字符，并为文本中的任何其他字符打开新的 CDATA 部分节点。

source: Packed: The views are packed together (after margins are accounted for).
zh_cn: Packed: view 被打包在一起(在考虑边距之后)。

source: Spread inside: The first and last view are affixed to the constraints on each end of the chain and the rest are evenly distributed.
zh_cn: Spread inside: 第一个和最后一个 view 被附加到链的每个端部上的约束，并且其余的是均匀分布的。

source: Spread: The views are evenly distributed (after margins are accounted for).
zh_cn: Spread: view 均匀分布(在考虑边距之后)。

source: Video 4. Creating a chain from the action menu
zh_cn: Video 4. 从操作菜单创建链

source: Video 5. Adjusting the constraint bias
zh_cn: Video 5. 调整约束编移

source: Weighted: When the chain is set to either spread or spread inside, you can fill the remaining space by setting one or more views to "match constraints" (0dp).
zh_cn: Weighted: 当链被设置为 spread 或 spread inside，你可以通过将一个或多个 view 设置为(0dp)来填充剩余空间。

source: Drawable objects (<shape> in XML) can take up a tiny amount of space in your APK.
zh_cn: Drawable 对象(XML 中的 <shape>)可占用 APK 中的少量空间。

source: DrawerLayout.DrawerListener can be used to monitor the state and motion of drawer views.
zh_cn: DrawerLayout.DrawerListener 可用于监控抽屉 view 的状态和动作。

source: LayoutParams subclass for children of RecyclerView.
zh_cn: LayoutParams 的子类，用于设置 RecyclerView 的子 view。

source: SwitchCompat is a version of the Switch widget which runs on devices back to API 7.
zh_cn: SwitchCompat 是 Switch 小部件的一个版本，它在设备上运行支持 API 7。

source: ViewAnimator that switches between two views, and has a factory from which these views are created.
zh_cn: ViewAnimator，可在两个 view 之间切换，并具有创建这些 view 的工厂。

source: ViewSwitcher that switches between two ImageViews when a new image is set on it.
zh_cn: ViewSwitcher 在设置新图像时在两个 ImageView 之间切换。

source: android:checkable - If true, the chip can be toggled.
zh_cn: android:checkable - 如果为 true，则可以切换 chip。

source: android:text - Sets the text of the chip.
zh_cn: android:text - 设置 chip 的文本。

source: app:checkedIcon and app:checkedIconEnabled - Sets a custom icon to use when checked.
zh_cn: app:checkedIcon 和 app:checkedIconEnabled - 设置选中时要使用的自定义图标。

source: app:chipIcon and app:chipIconEnabled - Sets the icon of the chip.
zh_cn: app:chipIcon 和 app:chipIconEnabled - 设置 chip 的图标。

source: app:closeIcon and app:closeIconEnabled - Sets a custom icon that the user can click to close.
zh_cn: app:closeIcon 和 app:closeIconEnabled - 设置用户可以点击关闭的自定义图标。

source: onMeasure() has no return value.
zh_cn: onMeasure() 没有返回值。

source: onSizeChanged() is called when your view is first assigned a size, and again if the size of your view changes for any reason.
zh_cn: 首次为 view 指定大小时，将调用 onSizeChanged()，如果 view 大小因任何原因发生更改，则会再次调用。

source: @Deprecated: The @Deprecated annotation must be used whenever the use of the annotated element is discouraged.
zh_cn: @Deprecated：在不建议使用注释元素时，必须使用 @Deprecated 注释。

source: @Override: The @Override annotation must be used whenever a method overrides the declaration or implementation from a super-class.
zh_cn: @Override：当某个方法替换了超类中的声明或实现时，必须使用 @Override 注释。

source: @SuppressWarnings: The @SuppressWarnings annotation should be used only under circumstances where it is impossible to eliminate a warning.
zh_cn: @SuppressWarnings：@SuppressWarnings 注释应该仅在无法消除警告的情况下使用。

source: AndroidManifest.xml: Contains the core Android manifest file.
zh_cn: AndroidManifest.xml：包含核心 Android 清单文件。

source: AttributeSet: This value may be null.
zh_cn: AttributeSet：此值可能为 null。

source: AttributeSet: the attributes to build the layout parameters from
zh_cn: AttributeSet：从中构建布局参数的属性

source: Bitmap.CompressFormat: The format of the compressed image
zh_cn: Bitmap.CompressFormat：压缩图像的格式

source: Bitmap: The bitmap to use inside the shader
zh_cn: Bitmap: 在着色器内使用的位图

source: BitmapFactory.Options: null-ok; Options that control downsampling and whether the image should be completely decoded, or just is size returned.
zh_cn: BitmapFactory.Options：可以为 null ；相关选项，用来控制 downsampling 以及图像是否应该完全解码，或者只是返回大小。

source: BitmapFactory.Options: null-ok; Options that control downsampling.
zh_cn: BitmapFactory.Options：可为 null ；控制采样的选项。

source: CHAIN_PACKED -- the elements of the chain will be packed together.
zh_cn: CHAIN_PACKED -- 链的元素将被打包在一起。

source: CHAIN_SPREAD -- the elements will be spread out (default style)
zh_cn: CHAIN_SPREAD --元素将会被展开(默认样式)。

source: CHAIN_SPREAD_INSIDE -- similar, but the endpoints of the chain will not be spread out
zh_cn: CHAIN_SPREAD_INSIDE -- 相似的，但是链的端点将会被展开

source: Canvas: Canvas to draw into
zh_cn: Canvas: 要绘制进的 Canvas

source: Configuration: A Configuration specifying what values to modify in the base Configuration of the original Context's resources.
zh_cn: Configuration：Configuration 指定在原始上下文资源的基本配置中要修改的值。

source: ConstraintLayout has a specific handling of widgets being marked as View.GONE.
zh_cn: ConstraintLayout 对被标记为 View.GONE 的小部件有特别的处理。

source: Context: This value must never be null.
zh_cn: Context：此值绝不能为 null。

source: DEBUG: Use to further note what is happening on the device that could be relevant to investigate and debug unexpected behaviors.
zh_cn: DEBUG：用于进一步记录设备上发生的可能与调查和调试意外行为相关的情况。

source: ERROR: Use when something fatal has happened, i.e. something will have user-visible consequences and won't be recoverable without explicitly deleting some data, uninstalling applications, wiping the data partitions or reflashing the entire device (or worse).
zh_cn: ERROR：在出现极其严重的情况时使用。例如，某些事件会导致用户可见的后果，如果不明确删除某些数据、卸载应用、清除数据分区或重写整个设备(或更糟)，则无法恢复。

source: GONE widgets, as usual, are not going to be displayed and are not part of the layout itself (i.e. their actual dimensions will not be changed if marked as GONE).
zh_cn: 通常，GONE 小部件不会被显示，并且不是布局本身的一部分(即如果标记为 GONE 则其实际尺寸将不会改变)。

source: INFORMATIVE: Use to note that something interesting to most people happened, i.e. when a situation is detected that is likely to have widespread impact, though isn't necessarily an error.
zh_cn: INFORMATIVE: ：用于记录大多数人感兴趣的信息。例如，当检测到某种情况会造成广泛的影响时，尽管不一定是错误，系统也会记录下来。

source: ImageDecoder.DecodeException: exception containing information about the decode interruption.
zh_cn: ImageDecoder.DecodeException：包含有关解码中断的信息的异常。

source: ImageDecoder.ImageInfo: information about the encoded image.
zh_cn: ImageDecoder.ImageInfo：有关编码图像的信息。

source: ImageDecoder.OnHeaderDecodedListener: for learning the ImageInfo and changing any default settings on the ImageDecoder.
zh_cn: ImageDecoder.OnHeaderDecodedListener：用于了解 ImageInfo 并更改 ImageDecoder 上的任何默认设置。

source: ImageDecoder.Source: object that created decoder.
zh_cn: ImageDecoder.Source：创建 decoder 的对象。

source: ImageDecoder.Source: representing the encoded image.
zh_cn: ImageDecoder.Source：表示编码图像。

source: ImageDecoder: the object performing the decode, for changing its default settings.
zh_cn: ImageDecoder：执行解码的对象，用于更改其默认设置。

source: LinedEditText is defined as an inner class within the NoteEditor activity, but it is public so that it could be accessed as NoteEditor.LinedEditText from outside of the NoteEditor class if desired.
zh_cn: LinedEditText 被定义为 NoteEditor activity 中的内部类，但它是公共的，因此如果需要，可以使用 NoteEditor 类从外部访问 NoteEditor.LinedEditText 。

source: META-INF/: Contains the CERT.SF and CERT.RSA signature files, as well as the MANIFEST.MF manifest file.
zh_cn: META-INF/：包含 CERT.SF 和 CERT.RSA 签名文件，以及 MANIFEST.MF 清单文件。

source: MaterialToolbar is a Toolbar that implements certain Material features, such as elevation overlays for Dark Themes.
zh_cn: MaterialToolbar 是 Toolbar，它实现了某些材质功能，例如黑暗主题的高程叠加。

source: Matrix: If not null, it is set to the shader's local matrix.
zh_cn: Matrix: 如果不为空，则将其设置为 shader 的局部矩阵。

source: Matrix: The shader's new local matrix, or null to specify identity
zh_cn: Matrix: shader 的新本地矩阵，或者 null 来指定同一性

source: MotionEvent: The motion event being dispatched down the hierarchy.
zh_cn: MotionEvent：在层次结构中分发的动作事件。

source: MotionEvent: The motion event.
zh_cn: MotionEvent：动作事件。

source: OutputStream: The outputstream to write the compressed data.
zh_cn: OutputStream：写入压缩数据的输出流。

source: PorterDuff.Mode: The PorterDuff mode that combines the colors from the two shaders.
zh_cn: PorterDuff.Mode: 组合来自两个着色器的颜色的 PorterDuff 模式。

source: PorterDuff.Mode: The porter-duff mode that is applied
zh_cn: PorterDuff.Mode: 应用的 porter-duff 模式

source: Rect: Rect to receive the output.
zh_cn: Rect:接收输出的 Rect 。

source: Rect: The rectangle that specified the region to be decode.
zh_cn: Rect：指定要解码的区域的矩形。

source: RecyclerView.State: The current state of RecyclerView
zh_cn: RecyclerView.State: RecyclerView 的当前状态。

source: RecyclerView.State: The current state of RecyclerView.
zh_cn: RecyclerView.State: RecyclerView 当前的状态。

source: RecyclerView will attempt to synthesize visible structural change events for adapters that report that they have #hasStableIds() stable IDs when this method is used.
zh_cn: RecyclerView 将尝试为适配器合成可见的结构更改事件，当这些适配器在使用此方法时报告具有 #hasStableIds() stable IDs。

source: RecyclerView: RecyclerView this ItemDecoration is decorating
zh_cn: RecyclerView: 该 ItemDecoration 在装饰的 RecyclerView。

source: RecyclerView: RecyclerView this ItemDecoration is drawing into
zh_cn: RecyclerView: 该 ItemDecoration 要绘制进的 RecyclerView

source: Shader.TileMode: The Shader tiling mode
zh_cn: Shader.TileMode: 着色器平铺模式

source: Shader.TileMode: The tiling mode for x to draw the bitmap in.
zh_cn: Shader.TileMode: x 方向绘制位图的平铺模式。

source: Shader.TileMode: The tiling mode for y to draw the bitmap in.
zh_cn: Shader.TileMode: y 方向绘制位图的平铺模式。

source: Shader: The colors from this shader are seen as the "dst" by the mode
zh_cn: Shader: 来自该着色器的颜色被模式视为 "dst"

source: Shader: The colors from this shader are seen as the "src" by the mode
zh_cn: Shader: 来自该着色器的颜色被模式视为 "src"

source: String: complete path name for the file to be decoded.
zh_cn: String：要解码的文件的完整路径名称。

source: System.out.println() (or printf() for native code) should never be used.
zh_cn: 请勿使用 System.out.println() （或针对原生代码使用 printf()）。

source: TextClock can display the current date and/or time as a formatted string.
zh_cn: TextClock 可以将当前日期和/或时间显示为格式化字符串。

source: VERBOSE: Use for everything else.
zh_cn: VERBOSE ：用于记录其他所有信息。

source: View: Apply the transformation to this page
zh_cn: View: 将转换应用于此页面

source: View: The child view to decorate
zh_cn: View: 要装饰的子 view。

source: View: The descendent view controlling the nested scroll
zh_cn: View：控制嵌套滚动的后代 view

source: WARNING: Use when something serious and unexpected happened, i.e. something that will have user-visible consequences but is likely to be recoverable without data loss by performing some explicit action, ranging from waiting or restarting an app all the way to re-downloading a new version of an application or rebooting the device.
zh_cn: WARNING：在出现比较严重和意外的情况时使用。例如，某些事件会导致用户可见的后果，但是通过执行某些明确的操作（从等待或重启应用，一直到重新下载新版应用或重新启动设备）可在不丢失数据的情况下恢复。

source: Xfermode: The mode that combines the colors from the two shaders.
zh_cn: Xfermode: 组合来自两个着色器的颜色的模式。

source: android:minHeight set the minimum height for the layout
zh_cn: android:minHeight 设置布局的最小高度

source: android:minWidth set the minimum width for the layout
zh_cn: android:minWidth 设置布局的最小宽度

source: assets/: Contains the app's assets, which the app can retrieve using an AssetManager object.
zh_cn: assets/：包含应用程序的资源，应用程序可以使用 AssetManager 对象获取该资源。

source: boolean: If true, then the default implementation of fitSystemWindows(Rect) will be executed.
zh_cn: boolean：如果为 true，则执行 fitSystemWindows(Rect) 的默认实现。

source: boolean: Whether results of getSpanIndex should be cached or not.
zh_cn: boolean: getSpanIndex 的结果是否应该缓存。

source: boolean: Whether to animate to the new state
zh_cn: boolean：是否动画到新状态

source: boolean: true if the child consumed the fling, false otherwise
zh_cn: boolean：如果 child 消耗了 fling，则返回 true，否则返回 false

source: boolean: true if the layout should be fully expanded, false if it should be fully collapsed
zh_cn: boolean：如果布局应该完全展开，则为 true;如果布局应完全折叠，则为 false

source: classes.dex: Contains the classes compiled in the DEX file format understood by the Dalvik/ART virtual machine.
zh_cn: classes.dex：包含以 Dalvik / ART 虚拟机理解的 DEX 文件格式编译的类。

source: float: May be null.
zh_cn: float：可能是 null。

source: float: May be NULL.
zh_cn: float：可能为 NULL。

source: float: Must be positive.
zh_cn: float：必须为正值。

source: float: Position of page relative to the current front-and-center position of the pager.
zh_cn: float: 相对于当前页面的中心点位置。

source: float: The x-coordinate for the end of the gradient line
zh_cn: float: 渐变线终点的 x 坐标:

source: float: The x-coordinate for the start of the gradient line
zh_cn: float: 渐变线起点的 x 坐标

source: float: The x-coordinate of the center
zh_cn: float：中心的 x 坐标

source: float: The x-coordinate of the center of the radius
zh_cn: float：半径中心的 x 坐标

source: float: The y-coordinate for the end of the gradient line
zh_cn: float：渐变线终点的 y 坐标

source: float: The y-coordinate for the start of the gradient line
zh_cn: float: 渐变线起点的 y 坐标

source: float: The y-coordinate of the center
zh_cn: float：中心的 y 坐标

source: float: The y-coordinate of the center of the radius
zh_cn: float：半径中心的 y 坐标

source: int: Duration of the scroll in milliseconds.
zh_cn: int：滚动的持续时间(以毫秒为单位)。

source: int: Hint to the compressor, 0-100.
zh_cn: int：给压缩器的提示， 0-100。

source: int: Horizontal distance to travel.
zh_cn: int：行程的水平距离。

source: int: Horizontal scroll distance in pixels already consumed by target
zh_cn: int：目标已消耗的水平滚动距离(以像素为单位)

source: int: Horizontal scroll distance in pixels not consumed by target
zh_cn: int：目标未消耗的水平滚动距离(以像素为单位)

source: int: Scroll to this adapter position
zh_cn: int：滚动到此适配器位置

source: int: Starting horizontal scroll offset in pixels.
zh_cn: int：起始水平滚动偏移(以像素为单位)。

source: int: Starting vertical scroll offset in pixels.
zh_cn: int：起始垂直滚动偏移(以像素为单位)。

source: int: The adapter position of the item
zh_cn: int：item 的 adapter position。

source: int: The color at the center of the circle.
zh_cn: int：圆形中心的颜色。

source: int: The color at the edge of the circle.
zh_cn: int：圆形边缘的颜色。

source: int: The color at the end of the gradient line.
zh_cn: int: 渐变线终点的颜色。

source: int: The color at the start of the gradient line.
zh_cn: int: 渐变线起点的颜色。

source: int: The color to use at the end of the sweep
zh_cn: int：在扫区结束时使用的颜色

source: int: The color to use at the start of the sweep
zh_cn: int：在扫区开始时使用的颜色

source: int: The colors to be distributed along the gradient line
zh_cn: int: 要沿渐变线分布的颜色

source: int: The colors to be distributed between around the center.
zh_cn: int：要在中心之间分配的颜色。

source: int: The colors to be distributed between the center and edge of the circle
zh_cn: int：要分布在圆的中心和边缘之间的颜色

source: int: The index of a capturing group in this matcher's pattern
zh_cn: int：此匹配器模式中捕获组的索引

source: int: The position in adapter
zh_cn: int：adapter 中的位置。

source: int: The position of the item
zh_cn: int：item 的位置。

source: int: The total number of spans in the grid
zh_cn: int：grid 中的 span 总数。

source: int: Vertical distance to travel.
zh_cn: int：行程的垂直距离。

source: int: Vertical scroll distance in pixels already consumed by target
zh_cn: int：目标已经消耗的垂直滚动距离(以像素为单位)

source: int: Vertical scroll distance in pixels not consumed by target
zh_cn: int：目标未消耗的垂直滚动距离(以像素为单位)

source: int: height in pixels of the output, must be greater than 0
zh_cn: int：输出的高度（以像素为单位）必须大于 0

source: int: sampling rate of the encoded image.
zh_cn: int：编码图像的采样率。

source: int: the amount of pixels to scroll by horizontally
zh_cn: int：水平滚动的像素数量

source: int: the amount of pixels to scroll by vertically
zh_cn: int：垂直滚动的像素数量

source: int: the x position to scroll to
zh_cn: int：要滚动到的 x 位置

source: int: the y position to scroll to
zh_cn: int：要滚动到的 y 位置

source: int: width in pixels of the output, must be greater than 0
zh_cn: int：输出的宽度（以像素为单位）必须大于 0

source: java and javax
zh_cn: java 和 javax

source: lib/: Contains the compiled code that is specific to the software layer of a processor.
zh_cn: lib/：包含特定于处理器软件层的已编译代码。

source: onMeasure() is a little more involved.
zh_cn: onMeasure() 相关的东西更多一些。

source: onNestedPreScroll is called when a nested scrolling child invokes dispatchNestedPreScroll(int, int, int[], int[]).
zh_cn: onNestedPreScroll 调用于，嵌套滚动子项调用 dispatchNestedPreScroll(int, int, int[], int[]) 时。
